## General workflow for the analysis of the predictions of the SyntaxSQL
### The spider evaluation scripts only prints out the wrong queries. 
### As the authors have made available the output of the evaluation script, which contains the wrongly predicted queries. 
### IT is possible to find how many/which queries are different from the our gold development set. Which comprises 4 databases.

## Open the dev results
### We changed the path twice to the augmented version of syntax sql and the normal baseline, and reruned the code to find out the % of correct queries.

In [373]:
import pandas as pd 
data = pd.read_csv("/Users/yuriy/Downloads/generated_datasets/generated_data_augment/saved_models/dev_result_eval.txt", sep="\t", header=None)
data

                                                                                                                                  0
0                                                          medium pred: select Song_Name,Country,Name from singer order by Age desc
1                                                          medium gold: SELECT name ,  country ,  age FROM singer ORDER BY age DESC
2                                                          medium pred: select Song_Name,Name,Country from singer order by Age desc
3                                                          medium gold: SELECT name ,  country ,  age FROM singer ORDER BY age DESC
4                              medium pred: select avg(Age),min(Age),max(Age) from singer where Age = (select max(Age) from singer)
...                                                                                                                             ...
1509  group                0.583                0.455                0.707                0.671                0.565
1510  order                0.600                0.462                0.672                0.795                0.643
1511  and/or               0.978                0.924                0.953                0.912                0.940
1512  IUEN                 1.000                1.000                0.074                1.000                0.041
1513  keywords             0.852                0.768                0.669                0.615                0.733

[1514 rows x 1 columns]

## Slice the data to the correct row, uncoment the cell for the augmented version

In [374]:
filtered_data= data[:1477]# <---- For the augmented version SyntaxSQLAugmented
#filtered_data= data[:1621] # <------- For the normal version of SyntaxSQL

In [375]:
filtered_data

                                                                                                                                                                                                  0
0                                                                                                                          medium pred: select Song_Name,Country,Name from singer order by Age desc
1                                                                                                                          medium gold: SELECT name ,  country ,  age FROM singer ORDER BY age DESC
2                                                                                                                          medium pred: select Song_Name,Name,Country from singer order by Age desc
3                                                                                                                          medium gold: SELECT name ,  country ,  age FROM singer ORDER BY age DESC
4                                                                                              medium pred: select avg(Age),min(Age),max(Age) from singer where Age = (select max(Age) from singer)
...                                                                                                                                                                                             ...
1472  medium gold: SELECT T2.feature_type_name FROM Other_Available_Features AS T1 JOIN Ref_Feature_Types AS T2 ON T1.feature_type_code  =  T2.feature_type_code WHERE T1.feature_name  =  "AirCon"
1473                                                                                                                          medium pred: select property_type_description from Ref_Property_Types
1474         medium gold: SELECT T2.property_type_description FROM Properties AS T1 JOIN Ref_Property_Types AS T2 ON T1.property_type_code  =  T2.property_type_code GROUP BY T1.property_type_code
1475                                                                                                        hard pred: select property_name from Properties where agreed_selling_price > 'terminal'
1476  hard gold: SELECT property_name FROM Properties WHERE property_type_code  =  "House" UNION SELECT property_name FROM Properties WHERE property_type_code  =  "Apartment" AND room_count  >  1

[1477 rows x 1 columns]

## Open the preselected databases of the development set

In [376]:
dev_gold = pd.read_csv("/Users/yuriy/Desktop/Neural-Rule-Based-model-for-Text-to-SQL/data/devPreSelected.csv", index_col=0)
dev_gold

,database,question,sql
0,poker_player,How many poker players are there?,SELECT count(*) FROM poker_player
1,poker_player,Count the number of poker players.,SELECT count(*) FROM poker_player
2,poker_player,List the earnings of poker players in descending order.,SELECT Earnings FROM poker_player ORDER BY Earnings DESC
3,poker_player,"What are the earnings of poker players, ordered descending by value?",SELECT Earnings FROM poker_player ORDER BY Earnings DESC
4,poker_player,List the final tables made and the best finishes of poker players.,"SELECT Final_Table_Made , Best_Finish FROM poker_player"
...,...,...,...
115,singer,What are the names of the singers that have more than one songs?,SELECT T1.Name FROM singer AS T1 JOIN song AS T2 ON T1.Singer_ID = T2.Singer_ID GROUP BY T1.Name HAVING COUNT(*) > 1
116,singer,Show the names of singers and the total sales of their songs.,"SELECT T1.Name , sum(T2.Sales) FROM singer AS T1 JOIN song AS T2 ON T1.Singer_ID = T2.Singer_ID GROUP BY T1.Name"
117,singer,"For each singer name, what is the total sales for their songs?","SELECT T1.Name , sum(T2.Sales) FROM singer AS T1 JOIN song AS T2 ON T1.Singer_ID = T2.Singer_ID GROUP BY T1.Name"
118,singer,List the name of singers that do not have any song.,SELECT Name FROM singer WHERE Singer_ID NOT IN (SELECT Singer_ID FROM song)
119,singer,What is the sname of every sing that does not have any song?,SELECT Name FROM singer WHERE Singer_ID NOT IN (SELECT Singer_ID FROM song)

## Filter the data from the wrong predicitions so there is only gold values, as we can compare them to the gold values of our development set and then count how many are missing (which would be the correct ones, as the evaluation script of spider only show the wrong queries)

In [377]:
filtered_data = filtered_data[0].str.split(":", n=1, expand=True)
filtered_data.columns = ['Column1', 'Column2']
filtered_data

,Column1,Column2
0,medium pred,"select Song_Name,Country,Name from singer order by Age desc"
1,medium gold,"SELECT name , country , age FROM singer ORDER BY age DESC"
2,medium pred,"select Song_Name,Name,Country from singer order by Age desc"
3,medium gold,"SELECT name , country , age FROM singer ORDER BY age DESC"
4,medium pred,"select avg(Age),min(Age),max(Age) from singer where Age = (select max(Age) from singer)"
...,...,...
1472,medium gold,"SELECT T2.feature_type_name FROM Other_Available_Features AS T1 JOIN Ref_Feature_Types AS T2 ON T1.feature_type_code = T2.feature_type_code WHERE T1.feature_name = ""AirCon"""
1473,medium pred,select property_type_description from Ref_Property_Types
1474,medium gold,SELECT T2.property_type_description FROM Properties AS T1 JOIN Ref_Property_Types AS T2 ON T1.property_type_code = T2.property_type_code GROUP BY T1.property_type_code
1475,hard pred,select property_name from Properties where agreed_selling_price > 'terminal'
1476,hard gold,"SELECT property_name FROM Properties WHERE property_type_code = ""House"" UNION SELECT property_name FROM Properties WHERE property_type_code = ""Apartment"" AND room_count > 1"

## Select only the rows that has gold in the description of the query

In [378]:
gold_values = filtered_data[filtered_data['Column1'].str.contains('gold')]['Column2']
gold_values_df = pd.DataFrame(gold_values, columns=['Column2'])
gold_values_df

                                                                                                                                                                                  Column2
1                                                                                                                             SELECT name ,  country ,  age FROM singer ORDER BY age DESC
3                                                                                                                             SELECT name ,  country ,  age FROM singer ORDER BY age DESC
5                                                                                                          SELECT avg(age) ,  min(age) ,  max(age) FROM singer WHERE country  =  'France'
7                                                                                                                  SELECT song_name ,  song_release_year FROM singer ORDER BY age LIMIT 1
9                                                                                                                SELECT song_name FROM singer WHERE age  >  (SELECT avg(age) FROM singer)
...                                                                                                                                                                                   ...
1468                                                          SELECT Citizenship FROM singer WHERE Birth_Year  <  1945 INTERSECT SELECT Citizenship FROM singer WHERE Birth_Year  >  1955
1470                                                          SELECT Citizenship FROM singer WHERE Birth_Year  <  1945 INTERSECT SELECT Citizenship FROM singer WHERE Birth_Year  >  1955
1472     SELECT T2.feature_type_name FROM Other_Available_Features AS T1 JOIN Ref_Feature_Types AS T2 ON T1.feature_type_code  =  T2.feature_type_code WHERE T1.feature_name  =  "AirCon"
1474            SELECT T2.property_type_description FROM Properties AS T1 JOIN Ref_Property_Types AS T2 ON T1.property_type_code  =  T2.property_type_code GROUP BY T1.property_type_code
1476   SELECT property_name FROM Properties WHERE property_type_code  =  "House" UNION SELECT property_name FROM Properties WHERE property_type_code  =  "Apartment" AND room_count  >  1

[737 rows x 1 columns]

## Now the task is to force the comparison between sets of queries, here we lower every string and remove empty spaces

In [379]:
gold_values_df["Column2"] = gold_values_df["Column2"].str.strip().str.lower()
dev_gold["sql"] = dev_gold["sql"].str.strip().str.lower()
gold_values_df

                                                                                                                                                                                 Column2
1                                                                                                                            select name ,  country ,  age from singer order by age desc
3                                                                                                                            select name ,  country ,  age from singer order by age desc
5                                                                                                         select avg(age) ,  min(age) ,  max(age) from singer where country  =  'france'
7                                                                                                                 select song_name ,  song_release_year from singer order by age limit 1
9                                                                                                               select song_name from singer where age  >  (select avg(age) from singer)
...                                                                                                                                                                                  ...
1468                                                         select citizenship from singer where birth_year  <  1945 intersect select citizenship from singer where birth_year  >  1955
1470                                                         select citizenship from singer where birth_year  <  1945 intersect select citizenship from singer where birth_year  >  1955
1472    select t2.feature_type_name from other_available_features as t1 join ref_feature_types as t2 on t1.feature_type_code  =  t2.feature_type_code where t1.feature_name  =  "aircon"
1474           select t2.property_type_description from properties as t1 join ref_property_types as t2 on t1.property_type_code  =  t2.property_type_code group by t1.property_type_code
1476  select property_name from properties where property_type_code  =  "house" union select property_name from properties where property_type_code  =  "apartment" and room_count  >  1

[737 rows x 1 columns]

In [380]:
dev_gold

,database,question,sql
0,poker_player,How many poker players are there?,select count(*) from poker_player
1,poker_player,Count the number of poker players.,select count(*) from poker_player
2,poker_player,List the earnings of poker players in descending order.,select earnings from poker_player order by earnings desc
3,poker_player,"What are the earnings of poker players, ordered descending by value?",select earnings from poker_player order by earnings desc
4,poker_player,List the final tables made and the best finishes of poker players.,"select final_table_made , best_finish from poker_player"
...,...,...,...
115,singer,What are the names of the singers that have more than one songs?,select t1.name from singer as t1 join song as t2 on t1.singer_id = t2.singer_id group by t1.name having count(*) > 1
116,singer,Show the names of singers and the total sales of their songs.,"select t1.name , sum(t2.sales) from singer as t1 join song as t2 on t1.singer_id = t2.singer_id group by t1.name"
117,singer,"For each singer name, what is the total sales for their songs?","select t1.name , sum(t2.sales) from singer as t1 join song as t2 on t1.singer_id = t2.singer_id group by t1.name"
118,singer,List the name of singers that do not have any song.,select name from singer where singer_id not in (select singer_id from song)
119,singer,What is the sname of every sing that does not have any song?,select name from singer where singer_id not in (select singer_id from song)

In [381]:
gold_values_df["Column2"] = gold_values_df["Column2"].str.replace(' ', '')
dev_gold["sql"] = dev_gold["sql"].str.replace(' ', '')

In [382]:
gold_values_df

                                                                                                                                                          Column2
1                                                                                                                  selectname,country,agefromsingerorderbyagedesc
3                                                                                                                  selectname,country,agefromsingerorderbyagedesc
5                                                                                                 selectavg(age),min(age),max(age)fromsingerwherecountry='france'
7                                                                                                     selectsong_name,song_release_yearfromsingerorderbyagelimit1
9                                                                                                    selectsong_namefromsingerwhereage>(selectavg(age)fromsinger)
...                                                                                                                                                           ...
1468                                                      selectcitizenshipfromsingerwherebirth_year<1945intersectselectcitizenshipfromsingerwherebirth_year>1955
1470                                                      selectcitizenshipfromsingerwherebirth_year<1945intersectselectcitizenshipfromsingerwherebirth_year>1955
1472  selectt2.feature_type_namefromother_available_featuresast1joinref_feature_typesast2ont1.feature_type_code=t2.feature_type_codewheret1.feature_name="aircon"
1474      selectt2.property_type_descriptionfrompropertiesast1joinref_property_typesast2ont1.property_type_code=t2.property_type_codegroupbyt1.property_type_code
1476     selectproperty_namefrompropertieswhereproperty_type_code="house"unionselectproperty_namefrompropertieswhereproperty_type_code="apartment"androom_count>1

[737 rows x 1 columns]

In [383]:
sql_gold= gold_values_df["Column2"].to_list()
sql_gold

['selectname,country,agefromsingerorderbyagedesc',
 'selectname,country,agefromsingerorderbyagedesc',
 "selectavg(age),min(age),max(age)fromsingerwherecountry='france'",
 'selectsong_name,song_release_yearfromsingerorderbyagelimit1',
 'selectsong_namefromsingerwhereage>(selectavg(age)fromsinger)',
 'selectsong_namefromsingerwhereage>(selectavg(age)fromsinger)',
 'selectlocation,namefromstadiumwherecapacitybetween5000and10000',
 'selectname,capacityfromstadiumorderbyaveragedesclimit1',
 'selectname,capacityfromstadiumorderbyaveragedesclimit1',
 'selectcount(*)fromconcertwhereyear=2014oryear=2015',
 'selectcount(*)fromconcertwhereyear=2014oryear=2015',
 'selectt2.name,count(*)fromconcertast1joinstadiumast2ont1.stadium_id=t2.stadium_idgroupbyt1.stadium_id',
 'selectt2.name,count(*)fromconcertast1joinstadiumast2ont1.stadium_id=t2.stadium_idgroupbyt1.stadium_id',
 'selectt2.name,t2.capacityfromconcertast1joinstadiumast2ont1.stadium_id=t2.stadium_idwheret1.year>=2014groupbyt2.stadium_idorderbycount(*)desclimit1',
 'selectt2.name,t2.capacityfromconcertast1joinstadiumast2ont1.stadium_id=t2.stadium_idwheret1.year>=2014groupbyt2.stadium_idorderbycount(*)desclimit1',
 'selectnamefromstadiumexceptselectt2.namefromconcertast1joinstadiumast2ont1.stadium_id=t2.stadium_idwheret1.year=2014',
 'selectnamefromstadiumexceptselectt2.namefromconcertast1joinstadiumast2ont1.stadium_id=t2.stadium_idwheret1.year=2014',
 'selectt2.concert_name,t2.theme,count(*)fromsinger_in_concertast1joinconcertast2ont1.concert_id=t2.concert_idgroupbyt2.concert_id',
 'selectt2.concert_name,t2.theme,count(*)fromsinger_in_concertast1joinconcertast2ont1.concert_id=t2.concert_idgroupbyt2.concert_id',
 'selectt2.name,count(*)fromsinger_in_concertast1joinsingerast2ont1.singer_id=t2.singer_idgroupbyt2.singer_id',
 'selectt2.name,count(*)fromsinger_in_concertast1joinsingerast2ont1.singer_id=t2.singer_idgroupbyt2.singer_id',
 'selectt2.name,t2.locationfromconcertast1joinstadiumast2ont1.stadium_id=t2.stadium_idwheret1.year=2014intersectselectt2.name,t2.locationfromconcertast1joinstadiumast2ont1.stadium_id=t2.stadium_idwheret1.year=2015',
 'selectt2.name,t2.locationfromconcertast1joinstadiumast2ont1.stadium_id=t2.stadium_idwheret1.year=2014intersectselectt2.name,t2.locationfromconcertast1joinstadiumast2ont1.stadium_id=t2.stadium_idwheret1.year=2015',
 'selectcount(*)fromconcertast1joinstadiumast2ont1.stadium_id=t2.stadium_idorderbyt2.capacitydesclimit1',
 'selectcount(*)fromconcertast1joinstadiumast2ont1.stadium_id=t2.stadium_idorderbyt2.capacitydesclimit1',
 'selectweightfrompetsorderbypet_agelimit1',
 'selectcount(*)fromstudentast1joinhas_petast2ont1.stuid=t2.stuidwheret1.age>20',
 'selectcount(*)fromstudentast1joinhas_petast2ont1.stuid=t2.stuidwheret1.age>20',
 "selectcount(*)fromstudentast1joinhas_petast2ont1.stuid=t2.stuidjoinpetsast3ont2.petid=t3.petidwheret1.sex='f'andt3.pettype='dog'",
 "selectcount(*)fromstudentast1joinhas_petast2ont1.stuid=t2.stuidjoinpetsast3ont2.petid=t3.petidwheret1.sex='f'andt3.pettype='dog'",
 "selectdistinctt1.fnamefromstudentast1joinhas_petast2ont1.stuid=t2.stuidjoinpetsast3ont3.petid=t2.petidwheret3.pettype='cat'ort3.pettype='dog'",
 "selectdistinctt1.fnamefromstudentast1joinhas_petast2ont1.stuid=t2.stuidjoinpetsast3ont3.petid=t2.petidwheret3.pettype='cat'ort3.pettype='dog'",
 "selectt1.fnamefromstudentast1joinhas_petast2ont1.stuid=t2.stuidjoinpetsast3ont3.petid=t2.petidwheret3.pettype='cat'intersectselectt1.fnamefromstudentast1joinhas_petast2ont1.stuid=t2.stuidjoinpetsast3ont3.petid=t2.petidwheret3.pettype='dog'",
 "selectt1.fnamefromstudentast1joinhas_petast2ont1.stuid=t2.stuidjoinpetsast3ont3.petid=t2.petidwheret3.pettype='cat'intersectselectt1.fnamefromstudentast1joinhas_petast2ont1.stuid=t2.stuidjoinpetsast3ont3.petid=t2.petidwheret3.pettype='dog'",
 "selectmajor,agefromstudentwherestuidnotin(selectt1.stuidfromstudentast1joinhas_petast2ont1.stuid=t2.stuidjoinpetsast3ont3.petid=t2.petidwheret3.pettype='cat')",
 "selectmajor,agefromstudentwherestuidnotin(selectt1.stuidfromstudentast1joinhas_petast2ont1.stuid=t2.stuidjoinpetsast3ont3.petid=t2.petidwheret3.pettype='cat')",
 "selectstuidfromstudentexceptselectt1.stuidfromstudentast1joinhas_petast2ont1.stuid=t2.stuidjoinpetsast3ont3.petid=t2.petidwheret3.pettype='cat'",
 "selectstuidfromstudentexceptselectt1.stuidfromstudentast1joinhas_petast2ont1.stuid=t2.stuidjoinpetsast3ont3.petid=t2.petidwheret3.pettype='cat'",
 "selectt1.fname,t1.agefromstudentast1joinhas_petast2ont1.stuid=t2.stuidjoinpetsast3ont3.petid=t2.petidwheret3.pettype='dog'andt1.stuidnotin(selectt1.stuidfromstudentast1joinhas_petast2ont1.stuid=t2.stuidjoinpetsast3ont3.petid=t2.petidwheret3.pettype='cat')",
 "selectt1.fname,t1.agefromstudentast1joinhas_petast2ont1.stuid=t2.stuidjoinpetsast3ont3.petid=t2.petidwheret3.pettype='dog'andt1.stuidnotin(selectt1.stuidfromstudentast1joinhas_petast2ont1.stuid=t2.stuidjoinpetsast3ont3.petid=t2.petidwheret3.pettype='cat')",
 'selectpettype,weightfrompetsorderbypet_agelimit1',
 'selectpetid,weightfrompetswherepet_age>1',
 'selectpetid,weightfrompetswherepet_age>1',
 'selectavg(pet_age),max(pet_age),pettypefrompetsgroupbypettype',
 'selectavg(pet_age),max(pet_age),pettypefrompetsgroupbypettype',
 'selectdistinctt1.fname,t1.agefromstudentast1joinhas_petast2ont1.stuid=t2.stuid',
 'selectdistinctt1.fname,t1.agefromstudentast1joinhas_petast2ont1.stuid=t2.stuid',
 "selectt2.petidfromstudentast1joinhas_petast2ont1.stuid=t2.stuidwheret1.lname='smith'",
 "selectt2.petidfromstudentast1joinhas_petast2ont1.stuid=t2.stuidwheret1.lname='smith'",
 'selectcount(*),t1.stuidfromstudentast1joinhas_petast2ont1.stuid=t2.stuidgroupbyt1.stuid',
 'selectcount(*),t1.stuidfromstudentast1joinhas_petast2ont1.stuid=t2.stuidgroupbyt1.stuid',
 'selectt1.fname,t1.sexfromstudentast1joinhas_petast2ont1.stuid=t2.stuidgroupbyt1.stuidhavingcount(*)>1',
 'selectt1.fname,t1.sexfromstudentast1joinhas_petast2ont1.stuid=t2.stuidgroupbyt1.stuidhavingcount(*)>1',
 "selectt1.lnamefromstudentast1joinhas_petast2ont1.stuid=t2.stuidjoinpetsast3ont3.petid=t2.petidwheret3.pet_age=3andt3.pettype='cat'",
 "selectt1.lnamefromstudentast1joinhas_petast2ont1.stuid=t2.stuidjoinpetsast3ont3.petid=t2.petidwheret3.pet_age=3andt3.pettype='cat'",
 'selectavg(age)fromstudentwherestuidnotin(selectt1.stuidfromstudentast1joinhas_petast2ont1.stuid=t2.stuid)',
 'selectavg(age)fromstudentwherestuidnotin(selectt1.stuidfromstudentast1joinhas_petast2ont1.stuid=t2.stuid)',
 'selectt1.contid,t1.continent,count(*)fromcontinentsast1joincountriesast2ont1.contid=t2.continentgroupbyt1.contid;',
 'selectt1.contid,t1.continent,count(*)fromcontinentsast1joincountriesast2ont1.contid=t2.continentgroupbyt1.contid;',
 'selectt1.fullname,t1.id,count(*)fromcar_makersast1joinmodel_listast2ont1.id=t2.makergroupbyt1.id;',
 'selectt1.fullname,t1.id,count(*)fromcar_makersast1joinmodel_listast2ont1.id=t2.makergroupbyt1.id;',
 'selectt1.modelfromcar_namesast1joincars_dataast2ont1.makeid=t2.idorderbyt2.horsepowerasclimit1;',
 'selectt1.modelfromcar_namesast1joincars_dataast2ont1.makeid=t2.idorderbyt2.horsepowerasclimit1;',
 'selectt1.modelfromcar_namesast1joincars_dataast2ont1.makeid=t2.idwheret2.weight<(selectavg(weight)fromcars_data)',
 'selectt1.modelfromcar_namesast1joincars_dataast2ont1.makeid=t2.idwheret2.weight<(selectavg(weight)fromcars_data)',
 "selectdistinctt1.makerfromcar_makersast1joinmodel_listast2ont1.id=t2.makerjoincar_namesast3ont2.model=t3.modeljoincars_dataast4ont3.makeid=t4.idwheret4.year='1970';",
 'selectt2.make,t1.yearfromcars_dataast1joincar_namesast2ont1.id=t2.makeidwheret1.year=(selectmin(year)fromcars_data);',
 'selectt2.make,t1.yearfromcars_dataast1joincar_namesast2ont1.id=t2.makeidwheret1.year=(selectmin(year)fromcars_data);',
 'selectdistinctt1.modelfrommodel_listast1joincar_namesast2ont1.model=t2.modeljoincars_dataast3ont2.makeid=t3.idwheret3.year>1980;',
 'selectt1.continent,count(*)fromcontinentsast1joincountriesast2ont1.contid=t2.continentjoincar_makersast3ont2.countryid=t3.countrygroupbyt1.continent;',
 'selectt1.continent,count(*)fromcontinentsast1joincountriesast2ont1.contid=t2.continentjoincar_makersast3ont2.countryid=t3.countrygroupbyt1.continent;',
 'selectt2.countrynamefromcar_makersast1joincountriesast2ont1.country=t2.countryidgroupbyt1.countryorderbycount(*)desclimit1;',
 'selectcount(*),t2.fullname,t2.idfrommodel_listast1joincar_makersast2ont1.maker=t2.idgroupbyt2.id;',
 'selectcount(*),t2.fullname,t2.idfrommodel_listast1joincar_makersast2ont1.maker=t2.idgroupbyt2.id;',
 "selectt1.acceleratefromcars_dataast1joincar_namesast2ont1.id=t2.makeidwheret2.make='amchornetsportabout(sw)';",
 "selectt1.acceleratefromcars_dataast1joincar_namesast2ont1.id=t2.makeidwheret2.make='amchornetsportabout(sw)';",
 "selectcount(*)fromcar_makersast1joincountriesast2ont1.country=t2.countryidwheret2.countryname='france';",
 "selectcount(*)fromcar_makersast1joincountriesast2ont1.country=t2.countryidwheret2.countryname='france';",
 "selectcount(*)frommodel_listast1joincar_makersast2ont1.maker=t2.idjoincountriesast3ont2.country=t3.countryidwheret3.countryname='usa';",
 "selectcount(*)frommodel_listast1joincar_makersast2ont1.maker=t2.idjoincountriesast3ont2.country=t3.countryidwheret3.countryname='usa';",
 'selectavg(mpg)fromcars_datawherecylinders=4;',
 'selectavg(mpg)fromcars_datawherecylinders=4;',
 'selectweightfromcars_datawherecylinders=4andyear=1974orderbyweightasclimit1;',
 'selectweightfromcars_datawherecylinders=4andyear=1974orderbyweightasclimit1;',
 'selectmaker,modelfrommodel_list;',
 'selectmaker,modelfrommodel_list;',
 'selectt1.countryname,t1.countryidfromcountriesast1joincar_makersast2ont1.countryid=t2.countrygroupbyt1.countryidhavingcount(*)>=1;',
 'selectt1.countryname,t1.countryidfromcountriesast1joincar_makersast2ont1.countryid=t2.countrygroupbyt1.countryidhavingcount(*)>=1;',
 'selectavg(weight),yearfromcars_datagroupbyyear;',
 'selectavg(weight),yearfromcars_datagroupbyyear;',
 "selectt1.countrynamefromcountriesast1joincontinentsast2ont1.continent=t2.contidjoincar_makersast3ont1.countryid=t3.countrywheret2.continent='europe'groupbyt1.countrynamehavingcount(*)>=3;",
 "selectt1.countrynamefromcountriesast1joincontinentsast2ont1.continent=t2.contidjoincar_makersast3ont1.countryid=t3.countrywheret2.continent='europe'groupbyt1.countrynamehavingcount(*)>=3;",
 'selectt2.horsepower,t1.makefromcar_namesast1joincars_dataast2ont1.makeid=t2.idwheret2.cylinders=3orderbyt2.horsepowerdesclimit1;',
 'selectt2.horsepower,t1.makefromcar_namesast1joincars_dataast2ont1.makeid=t2.idwheret2.cylinders=3orderbyt2.horsepowerdesclimit1;',
 'selectt1.modelfromcar_namesast1joincars_dataast2ont1.makeid=t2.idorderbyt2.mpgdesclimit1;',
 'selectt1.modelfromcar_namesast1joincars_dataast2ont1.makeid=t2.idorderbyt2.mpgdesclimit1;',
 'selectavg(horsepower)fromcars_datawhereyear<1980;',
 "selectavg(t2.edispl)fromcar_namesast1joincars_dataast2ont1.makeid=t2.idwheret1.model='volvo';",
 "selectavg(t2.edispl)fromcar_namesast1joincars_dataast2ont1.makeid=t2.idwheret1.model='volvo';",
 'selectmax(accelerate),cylindersfromcars_datagroupbycylinders;',
 'selectmax(accelerate),cylindersfromcars_datagroupbycylinders;',
 'selectcount(*)fromcars_datawherecylinders>4;',
 'selectcount(*)fromcars_datawherecylinders>4;',
 'selectcount(*)fromcars_datawhereyear=1980;',
 "selectcount(*)fromcar_makersast1joinmodel_listast2ont1.id=t2.makerwheret1.fullname='americanmotorcompany';",
 "selectcount(*)fromcar_makersast1joinmodel_listast2ont1.id=t2.makerwheret1.fullname='americanmotorcompany';",
 'selectt1.fullname,t1.idfromcar_makersast1joinmodel_listast2ont1.id=t2.makergroupbyt1.idhavingcount(*)>3;',
 'selectt1.fullname,t1.idfromcar_makersast1joinmodel_listast2ont1.id=t2.makergroupbyt1.idhavingcount(*)>3;',
 "selectdistinctt2.modelfromcar_namesast1joinmodel_listast2ont1.model=t2.modeljoincar_makersast3ont2.maker=t3.idjoincars_dataast4ont1.makeid=t4.idwheret3.fullname='generalmotors'ort4.weight>3500;",
 "selectdistinctt2.modelfromcar_namesast1joinmodel_listast2ont1.model=t2.modeljoincar_makersast3ont2.maker=t3.idjoincars_dataast4ont1.makeid=t4.idwheret3.fullname='generalmotors'ort4.weight>3500;",
 'selectdistinctt1.yearfromcars_dataast1wheret1.weight>3000andt1.weight<4000;',
 'selectdistinctt1.yearfromcars_dataast1wheret1.weight>3000andt1.weight<4000;',
 "selectt1.cylindersfromcars_dataast1joincar_namesast2ont1.id=t2.makeidwheret2.model='volvo'orderbyt1.accelerateasclimit1;",
 "selectt1.cylindersfromcars_dataast1joincar_namesast2ont1.id=t2.makeidwheret2.model='volvo'orderbyt1.accelerateasclimit1;",
 'selectcount(*)fromcars_datawhereaccelerate>(selectacceleratefromcars_dataorderbyhorsepowerdesclimit1);',
 'selectcount(*)fromcars_datawhereaccelerate>(selectacceleratefromcars_dataorderbyhorsepowerdesclimit1);',
 'selectcount(*)from(selectt1.countryid,count(*)fromcountriesast1joincar_makersast2ont1.countryid=t2.countrygroupbyt1.countryidhavingcount(*)>2);',
 'selectcount(*)from(selectt1.countryid,count(*)fromcountriesast1joincar_makersast2ont1.countryid=t2.countrygroupbyt1.countryidhavingcount(*)>2);',
 'selectcount(*)fromcars_datawherecylinders>6;',
 'selectcount(*)fromcars_datawherecylinders>6;',
 'selectt1.modelfromcar_namesast1joincars_dataast2ont1.makeid=t2.idwheret2.cylinders=4orderbyt2.horsepowerdesclimit1;',
 'selectt1.modelfromcar_namesast1joincars_dataast2ont1.makeid=t2.idwheret2.cylinders=4orderbyt2.horsepowerdesclimit1;',
 'selectt2.makeid,t2.makefromcars_dataast1joincar_namesast2ont1.id=t2.makeidwheret1.horsepower>(selectmin(horsepower)fromcars_data)andt1.cylinders<=3;',
 'selectt2.makeid,t2.makefromcars_dataast1joincar_namesast2ont1.id=t2.makeidwheret1.horsepower>(selectmin(horsepower)fromcars_data)andt1.cylinders<=3;',
 'selectmpgfromcars_datawherecylinders=8oryear<1980orderbympgdesclimit1;',
 'selectmpgfromcars_datawherecylinders=8oryear<1980orderbympgdesclimit1;',
 "selectdistinctt1.modelfrommodel_listast1joincar_namesast2ont1.model=t2.modeljoincars_dataast3ont2.makeid=t3.idjoincar_makersast4ont1.maker=t4.idwheret3.weight<3500andt4.fullname!='fordmotorcompany';",
 "selectdistinctt1.modelfrommodel_listast1joincar_namesast2ont1.model=t2.modeljoincars_dataast3ont2.makeid=t3.idjoincar_makersast4ont1.maker=t4.idwheret3.weight<3500andt4.fullname!='fordmotorcompany';",
 'selectcountrynamefromcountriesexceptselectt1.countrynamefromcountriesast1joincar_makersast2ont1.countryid=t2.country;',
 'selectcountrynamefromcountriesexceptselectt1.countrynamefromcountriesast1joincar_makersast2ont1.countryid=t2.country;',
 'selectt1.id,t1.makerfromcar_makersast1joinmodel_listast2ont1.id=t2.makergroupbyt1.idhavingcount(*)>=2intersectselectt1.id,t1.makerfromcar_makersast1joinmodel_listast2ont1.id=t2.makerjoincar_namesast3ont2.model=t3.modelgroupbyt1.idhavingcount(*)>3;',
 'selectt1.id,t1.makerfromcar_makersast1joinmodel_listast2ont1.id=t2.makergroupbyt1.idhavingcount(*)>=2intersectselectt1.id,t1.makerfromcar_makersast1joinmodel_listast2ont1.id=t2.makerjoincar_namesast3ont2.model=t3.modelgroupbyt1.idhavingcount(*)>3;',
 "selectt1.countryid,t1.countrynamefromcountriesast1joincar_makersast2ont1.countryid=t2.countrygroupbyt1.countryidhavingcount(*)>3unionselectt1.countryid,t1.countrynamefromcountriesast1joincar_makersast2ont1.countryid=t2.countryjoinmodel_listast3ont2.id=t3.makerwheret3.model='fiat';",
 "selectt1.countryid,t1.countrynamefromcountriesast1joincar_makersast2ont1.countryid=t2.countrygroupbyt1.countryidhavingcount(*)>3unionselectt1.countryid,t1.countrynamefromcountriesast1joincar_makersast2ont1.countryid=t2.countryjoinmodel_listast3ont2.id=t3.makerwheret3.model='fiat';",
 'selectcountryfromairlineswhereairline="jetblueairways"',
 'selectcountryfromairlineswhereairline="jetblueairways"',
 'selectabbreviationfromairlineswhereairline="jetblueairways"',
 'selectabbreviationfromairlineswhereairline="jetblueairways"',
 'selectairline,abbreviationfromairlineswherecountry="usa"',
 'selectairline,abbreviationfromairlineswherecountry="usa"',
 'selectairportcode,airportnamefromairportswherecity="anthony"',
 'selectairlinefromairlineswhereabbreviation="ual"',
 'selectairlinefromairlineswhereabbreviation="ual"',
 'selectcity,countryfromairportswhereairportname="alton"',
 'selectcity,countryfromairportswhereairportname="alton"',
 'selectairportnamefromairportswhereairportcode="ako"',
 'selectairportnamefromairportswherecity="aberdeen"',
 'selectairportnamefromairportswherecity="aberdeen"',
 'selectcount(*)fromflightsast1joinairportsast2ont1.sourceairport=t2.airportcodewheret2.city="aberdeen"',
 'selectcount(*)fromflightsast1joinairportsast2ont1.sourceairport=t2.airportcodewheret2.city="aberdeen"',
 'selectcount(*)fromflightsast1joinairportsast2ont1.destairport=t2.airportcodewheret2.city="aberdeen"',
 'selectcount(*)fromflightsast1joinairportsast2ont1.destairport=t2.airportcodewheret2.city="aberdeen"',
 'selectcount(*)fromflightsast1joinairportsast2ont1.destairport=t2.airportcodejoinairportsast3ont1.sourceairport=t3.airportcodewheret2.city="ashley"andt3.city="aberdeen"',
 'selectcount(*)fromflightsast1joinairportsast2ont1.destairport=t2.airportcodejoinairportsast3ont1.sourceairport=t3.airportcodewheret2.city="ashley"andt3.city="aberdeen"',
 'selectcount(*)fromflightsast1joinairlinesast2ont1.airline=t2.uidwheret2.airline="jetblueairways"',
 'selectcount(*)fromflightsast1joinairlinesast2ont1.airline=t2.uidwheret2.airline="jetblueairways"',
 'selectcount(*)fromairlinesast1joinflightsast2ont2.airline=t1.uidwheret1.airline="unitedairlines"andt2.destairport="asy"',
 'selectcount(*)fromairlinesast1joinflightsast2ont2.airline=t1.uidwheret1.airline="unitedairlines"andt2.destairport="asy"',
 'selectcount(*)fromairlinesast1joinflightsast2ont2.airline=t1.uidwheret1.airline="unitedairlines"andt2.sourceairport="ahd"',
 'selectcount(*)fromairlinesast1joinflightsast2ont2.airline=t1.uidwheret1.airline="unitedairlines"andt2.sourceairport="ahd"',
 'selectcount(*)fromflightsast1joinairportsast2ont1.destairport=t2.airportcodejoinairlinesast3ont3.uid=t1.airlinewheret2.city="aberdeen"andt3.airline="unitedairlines"',
 'selectcount(*)fromflightsast1joinairportsast2ont1.destairport=t2.airportcodejoinairlinesast3ont3.uid=t1.airlinewheret2.city="aberdeen"andt3.airline="unitedairlines"',
 'selectt1.cityfromairportsast1joinflightsast2ont1.airportcode=t2.destairportgroupbyt1.cityorderbycount(*)desclimit1',
 'selectt1.cityfromairportsast1joinflightsast2ont1.airportcode=t2.destairportgroupbyt1.cityorderbycount(*)desclimit1',
 'selectt1.cityfromairportsast1joinflightsast2ont1.airportcode=t2.sourceairportgroupbyt1.cityorderbycount(*)desclimit1',
 'selectt1.cityfromairportsast1joinflightsast2ont1.airportcode=t2.sourceairportgroupbyt1.cityorderbycount(*)desclimit1',
 'selectt1.airportcodefromairportsast1joinflightsast2ont1.airportcode=t2.destairportort1.airportcode=t2.sourceairportgroupbyt1.airportcodeorderbycount(*)desclimit1',
 'selectt1.airportcodefromairportsast1joinflightsast2ont1.airportcode=t2.destairportort1.airportcode=t2.sourceairportgroupbyt1.airportcodeorderbycount(*)desclimit1',
 'selectt1.airportcodefromairportsast1joinflightsast2ont1.airportcode=t2.destairportort1.airportcode=t2.sourceairportgroupbyt1.airportcodeorderbycount(*)limit1',
 'selectt1.airportcodefromairportsast1joinflightsast2ont1.airportcode=t2.destairportort1.airportcode=t2.sourceairportgroupbyt1.airportcodeorderbycount(*)limit1',
 'selectt1.airlinefromairlinesast1joinflightsast2ont1.uid=t2.airlinegroupbyt1.airlineorderbycount(*)desclimit1',
 'selectt1.airlinefromairlinesast1joinflightsast2ont1.uid=t2.airlinegroupbyt1.airlineorderbycount(*)desclimit1',
 'selectt1.abbreviation,t1.countryfromairlinesast1joinflightsast2ont1.uid=t2.airlinegroupbyt1.airlineorderbycount(*)limit1',
 'selectt1.abbreviation,t1.countryfromairlinesast1joinflightsast2ont1.uid=t2.airlinegroupbyt1.airlineorderbycount(*)limit1',
 'selectt1.airlinefromairlinesast1joinflightsast2ont1.uid=t2.airlinewheret2.sourceairport="ahd"',

## Calculate how many queries can be found from the development evaluation of Syntax Sql in our development set. 
### Reminder we are calculating the number of incorrect queries. Because the evaluation script of spider only shows the wrong queries

In [384]:
index_match = []

i = 0
for value in dev_gold['sql']:
    if value in sql_gold:
        index_match.append(i)
    i+=1

index_match

[2,
 3,
 4,
 5,
 10,
 11,
 12,
 13,
 16,
 17,
 20,
 21,
 22,
 23,
 36,
 37,
 41,
 42,
 44,
 46,
 48,
 49,
 50,
 51,
 52,
 56,
 57,
 64,
 65,
 66,
 67,
 68,
 69,
 70,
 71,
 72,
 73,
 74,
 75,
 76,
 77,
 82,
 83,
 86,
 87,
 88,
 89,
 90,
 91,
 98,
 99,
 100,
 101,
 102,
 103,
 108,
 109,
 114,
 115,
 116,
 117,
 118,
 119]

## Number of wrong queries using the predicitons of dev_result_eval Augmented

In [385]:
print(len(index_match))
# The number of wrong queries for augmented data is 63
# The number of wrong queries for non-augmented data is 69
print(f"Percentage of correct queries is {(len(dev_gold)-len(index_match))/len(dev_gold)*100}%")

63
Percentage of correct queries is 47.5%